Repository: ArcticaProject/vcxsrv
Catalog: mesalib/src/mesa/drivers/dri/common/xmlpool/*.po
Languages: de

source: Debugging
de: Fehlersuche

source: Disable 3D acceleration
de: 3D-Beschleunigung abschalten

source: Show performance boxes
de: Zeige Performanceboxen

source: Enable flushing batchbuffer after each draw call
de: Aktiviere sofortige Leerung des Stapelpuffers nach jedem Zeichenaufruf

source: Enable flushing GPU caches with each draw call
de: Aktiviere sofortige Leerung der GPU-Zwischenspeicher mit jedem Zeichenaufruf

source: Image Quality
de: Bildqualität

source: Texture color depth
de: Texturfarbtiefe

source: Prefer frame buffer color depth
de: Bevorzuge Farbtiefe des Framebuffers

source: Prefer 32 bits per texel
de: Bevorzuge 32 bits pro Texel

source: Prefer 16 bits per texel
de: Bevorzuge 16 bits pro Texel

source: Force 16 bits per texel
de: Erzwinge 16 bits pro Texel

source: Initial maximum value for anisotropic texture filtering
de: Initialer Maximalwert für anisotropische Texturfilterung

source: Forbid negative texture LOD bias
de: Verbiete negative Textur-Detailgradverschiebung

source: Enable S3TC texture compression even if software support is not available
de: Aktiviere S3TC Texturkomprimierung auch wenn die nötige Softwareunterstützung fehlt

source: Initial color reduction method
de: Initiale Farbreduktionsmethode

source: Round colors
de: Farben runden

source: Dither colors
de: Farben rastern

source: Color rounding method
de: Farbrundungsmethode

source: Round color components downward
de: Farbkomponenten abrunden

source: Round to nearest color
de: Zur ähnlichsten Farbe runden

source: Color dithering method
de: Farbrasterungsmethode

source: Horizontal error diffusion
de: Horizontale Fehlerstreuung

source: Horizontal error diffusion, reset error at line start
de: Horizontale Fehlerstreuung, Fehler am Zeilenanfang zurücksetzen

source: Ordered 2D color dithering
de: Geordnete 2D Farbrasterung

source: Floating point depth buffer
de: Fließkomma z-Puffer

source: A post-processing filter to cel-shade the output
de: Nachbearbeitungsfilter für Cell Shading

source: A post-processing filter to remove the red channel
de: Nachbearbeitungsfilter zum Entfernen des Rotkanals

source: A post-processing filter to remove the green channel
de: Nachbearbeitungsfilter zum Entfernen des Grünkanals

source: A post-processing filter to remove the blue channel
de: Nachbearbeitungsfilter zum Entfernen des Blaukanals

source: Morphological anti-aliasing based on Jimenez\' MLAA. 0 to disable, 8 for default quality
de: Morphologische Kantenglättung (Anti-Aliasing) basierend auf Jimenez' MLAA. 0 für deaktiviert, 8 für Standardqualität

source: Morphological anti-aliasing based on Jimenez\' MLAA. 0 to disable, 8 for default quality. Color version, usable with 2d GL apps
de: Morphologische Kantenglättung (Anti-Aliasing) basierend auf Jimenez' MLAA. 0 für deaktiviert, 8 für Standardqualität. Farbversion, für 2D-Anwendungen

source: Performance
de: Leistung

source: TCL mode (Transformation, Clipping, Lighting)
de: TCL-Modus (Transformation, Clipping, Licht)

source: Use software TCL pipeline
de: Benutze die Software-TCL-Pipeline

source: Use hardware TCL as first TCL pipeline stage
de: Benutze Hardware TCL als erste Stufe der TCL-Pipeline

source: Bypass the TCL pipeline
de: Umgehe die TCL-Pipeline

source: Bypass the TCL pipeline with state-based machine code generated on-the-fly
de: Umgehe die TCL-Pipeline mit zur Laufzeit erzeugtem, zustandsbasiertem Maschinencode

source: Method to limit rendering latency
de: Methode zur Begrenzung der Bildverzögerung

source: Busy waiting for the graphics hardware
de: Aktives Warten auf die Grafikhardware

source: Sleep for brief intervals while waiting for the graphics hardware
de: Kurze Schlafintervalle beim Warten auf die Grafikhardware

source: Let the graphics hardware emit a software interrupt and sleep
de: Die Grafikhardware eine Softwareunterbrechnung erzeugen lassen und schlafen

source: Synchronization with vertical refresh (swap intervals)
de: Synchronisation mit der vertikalen Bildwiederholung

source: Never synchronize with vertical refresh, ignore application's choice
de: Niemals mit der Bildwiederholung synchronisieren, Anweisungen der Anwendung ignorieren

source: Initial swap interval 0, obey application's choice
de: Initiales Bildinterval 0, Anweisungen der Anwendung gehorchen

source: Initial swap interval 1, obey application's choice
de: Initiales Bildinterval 1, Anweisungen der Anwendung gehorchen

source: Always synchronize with vertical refresh, application chooses the minimum swap interval
de: Immer mit der Bildwiederholung synchronisieren, Anwendung wählt das minimale Bildintervall

source: Use HyperZ to boost performance
de: HyperZ zur Leistungssteigerung verwenden

source: Number of texture units used
de: Anzahl der benutzten Textureinheiten

source: Texture filtering quality vs. speed, AKA “brilinear” texture filtering
de: Texturfilterqualität versus -geschwindigkeit, auch bekannt als „brilineare“ Texturfilterung

source: Used types of texture memory
de: Benutzte Arten von Texturspeicher

source: All available memory
de: Aller verfügbarer Speicher

source: Only card memory (if available)
de: Nur Grafikspeicher (falls verfügbar)

source: Only GART (AGP/PCIE) memory (if available)
de: Nur GART-Speicher (AGP/PCIE) (falls verfügbar)

source: Features that are not hardware-accelerated
de: Funktionalität, die nicht hardwarebeschleunigt ist

source: Enable extension GL_ARB_vertex_program
de: Erweiterung GL_ARB_vertex_program aktivieren
